/********************************************************************************/
#ifndef __ADC_IC_H
#define __ADC_IC_H
/********************************************************************************/
#ifdef  ADC_IC_GLOBALS
#define ADC_IC_EXT
#else
#define ADC_IC_EXT extern
#endif
/**************************************************************/


/*----------------------------------------------------------*/
// 외부 호출 함수
//


#ifdef __MAKER_ANTS__ // AAU/PRU of ANTS

ADC_IC_EXT int Open_ADC_ic_file( INT8U adc_num );

ADC_IC_EXT void Close_ADC_ic_file( INT8U adc_num );

ADC_IC_EXT void Close_ADC_ic_file_all( void );

ADC_IC_EXT INT16U Get_ADC_voltage( INT8U adc_num );

ADC_IC_EXT void Open_ADC_ic_all( void );


#endif

/*----------------------------------------------------------*/
// 외부 참조 변수
//

/*----------------------------------------------------------*/


/********************************************************************************/
#endif
/********************************************************************************/

