/********************************************************************************/
#ifndef __DOWNLOAD_ZIP_H
#define __DOWNLOAD_ZIP_H
/********************************************************************************/
#ifdef  DOWNLOAD_ZIP_GLOBALS
#define DOWNLOAD_ZIP_EXT
#else
#define DOWNLOAD_ZIP_EXT extern
#endif
/**************************************************************/

/*----------------------------------------------------------*/
//#define

/*----------------------------------------------------------*/
// 외부 호출 함수
//


DOWNLOAD_ZIP_EXT void Check_DN_Image_zip( void );






//DOWNLOAD_ZIP_EXT void test_ftp(void);


DOWNLOAD_ZIP_EXT int clr_all_file(char *wdir); // wdir 에 있는 zip delete
DOWNLOAD_ZIP_EXT int unzip_file_to_dir(char *src_dir_file, char *wdir);



/*----------------------------------------------------------*/
// 외부 참조 변수
//




/*----------------------------------------------------------*/



/********************************************************************************/
#endif
/********************************************************************************/
